In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "name": ['Ashish', 'Harry', 'Rohan', 'Subh'],
    "Salary": [92, 34, 24, 17],
    "City": ['Rampur', 'Kolkata', 'Jaipur', 'Patna']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  Salary     City
0  Ashish      92   Rampur
1   Harry      34  Kolkata
2   Rohan      24   Jaipur
3    Subh      17    Patna

In [5]:
df.to_csv('data_folder/friends.csv')

In [6]:
# csv file without index
df.to_csv('data_folder/friends_without_index.csv', index=False)

In [7]:
# to show rows from first
df.head(2)

     name  Salary     City
0  Ashish      92   Rampur
1   Harry      34  Kolkata

In [8]:
# to show rows from last
df.tail(2)

    name  Salary    City
2  Rohan      24  Jaipur
3   Subh      17   Patna

In [10]:
# to see the max, min, count etc of the numerical columns
df.describe()

         Salary
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [11]:
data_frame = pd.read_csv('data_folder/ashish.csv')

In [12]:
data_frame

   Train  Speed     City
0    123     12   Rampur
1    456     23  Kolkata
2    789     34   Jaipur
3     12     45    Patna

In [15]:
data_frame['Speed']

0    12
1    23
2    34
3    45
Name: Speed, dtype: int64

In [16]:
data_frame['Speed'][0]

12

In [17]:
data_frame['Speed'][0] = 50

/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [18]:
data_frame

   Train  Speed     City
0    123     50   Rampur
1    456     23  Kolkata
2    789     34   Jaipur
3     12     45    Patna

In [20]:
data_frame.to_csv('data_folder/updated_ashish.csv', index=False)

In [24]:
# code to change the index instead of builtin 0,1,2,3
data_frame.index = ['first', 'second', 'third', 'fourth']

In [22]:
data_frame

        Train  Speed     City
first     123     50   Rampur
second    456     23  Kolkata
third     789     34   Jaipur
fourth     12     45    Patna